; domain
(define (domain orbital)

    (:requirements :typing :fluents)

    (:types
        module - object
    )

    (:predicates
        (linked ?f1 - module ?f2 - module)
    )

    (:functions
        (oxygen ?b - module)
        (power_drain)
    )

    ;; Move a person from a unit f1 to a unit f2
    (:action vent-fast
        :parameters (?f1 - module ?f2 - module)
        :precondition (and (>= (oxygen ?f1) 4) (linked ?f1 ?f2))
        :effect (and(decrease (oxygen ?f1) 4) (increase (oxygen ?f2) 2) (increase (power_drain) 1))
    )

    (:action vent-slow
        :parameters (?f1 - module ?f2 - module)
        :precondition (and (>= (oxygen ?f1) 1) (linked ?f1 ?f2))
        :effect (and(decrease (oxygen ?f1) 1) (increase (oxygen ?f2) 1))
    )

)

; problem
(define (problem farmland_5_star)
  (:domain orbital)
  (:objects
    module0 module1 module2 module3 module4 - module
  )
  (:init
    (= (power_drain) 0)
    (= (oxygen module0) 12)
    (= (oxygen module1) 0)
    (= (oxygen module2) 0)
    (= (oxygen module3) 0)
    (= (oxygen module4) 0)
    (linked module0 module1)
    (linked module1 module0)
    (linked module0 module2)
    (linked module2 module0)
    (linked module0 module3)
    (linked module3 module0)
    (linked module0 module4)
    (linked module4 module0)
  )
  (:goal
    (and
      (>= (oxygen module1) 1)
      (>= (oxygen module2) 1)
      (>= (oxygen module3) 1)
      (>= (oxygen module4) 1)
    )
  )
)

; plan
1. (vent-slow module0 module1)
   changed: (oxygen module0) from 12 to 11, (oxygen module1) from 0 to 1
   goals met: 1 of 4
2. (vent-slow module0 module2)
   changed: (oxygen module0) from 11 to 10, (oxygen module2) from 0 to 1
   goals met: 2 of 4
3. (vent-slow module0 module3)
   changed: (oxygen module0) from 10 to 9, (oxygen module3) from 0 to 1
   goals met: 3 of 4
4. (vent-slow module0 module4)
   changed: (oxygen module0) from 9 to 8, (oxygen module4) from 0 to 1
   goals met: 4 of 4
